"""
J박스 다국어
 
시간 제한	메모리 제한	제출	정답	맞힌 사람	정답 비율
1 초	128 MB	8060	3441	3126	43.513%
문제
아래 예제 출력과 같은 J박스를 출력하는 프로그램을 작성하시오.

입력
첫째 줄에 테스트 케이스의 개수가 주어진다. 각 테스트 케이스는 한 줄로 이루어져 있고, 박스의 크기가 주어진다. 박스의 크기는 10보다 작거나 같다.

출력
각 테스트 케이스에 대해서, 입력으로 주어지는 크기의 J박스를 출력한다. 박스와 박스 사이에는 빈 줄을 하나 출력한다.

예제 입력 1 
3
3
5
4
예제 출력 1 
###
#J#
###

#####
#JJJ#
#JJJ#
#JJJ#
#####

####
#JJ#
#JJ#
####
"""

#Answer
import sys
input = sys.stdin.readline

for _ in range(int(input())):
    n = int(input())
    print('#'*n)
    for _ in range(n-2):
        print('#'+'J'*(n-2)+'#')
    if n > 1:
        print('#'*n)
    print()