/*
역원소 정렬
 
시간 제한   메모리 제한
1 초   128 MB
문제
모든 원소가 양의 정수인 집합이 있을 때, 원소를 거꾸로 뒤집고 그 원소를 오름차순으로 정렬하는 프로그램을 작성하세요.

단, 원소를 뒤집었을 때 0이 앞에 선행되는 경우는 0을 생략해야합니다.

입력
첫 번째로 입력되는 건 n (1 ≤ n ≤ 10^6)으로 사용자가 뒤이어 입력할 원소값을 결정합니다. 
입력하는 줄에는 하나의 원소값 뿐만 아니라 여러 원소값도 들어갈 수 있습니다.

단, 입력하는 정수는 10^12을 넘어선 안 됩니다.

출력
출력문은 위 문제 내용에 나와있는 정렬방법으로 정렬하여 아래 예제 출력을 참고하여 출력하세요.

예제 입력 1 
10 5 2233
1601 90100 13009 802
50000000
301 7654321
210
예제 출력 1 
5
5
12
103
109
208
1061
3322
90031
1234567
*/

#include <bits/stdc++.h>

using namespace std;

int main() {
    int n;
    cin >> n;

    vector<long long> v;
    for (int i = 0; i < n; i++) {
        string s;
        cin >> s;
        reverse(s.begin(), s.end());
        v.push_back(stoll(s));
    }

    sort(v.begin(), v.end());

    for (auto i : v) 
        cout << i << '\n';

    return 0;
}