"""
수들의 합 5 다국어
 
시간 제한   메모리 제한   제출   정답   맞힌 사람   정답 비율
2 초   32 MB   22970   10986   8253   49.017%
문제
어떠한 자연수 N은, 몇 개의 연속된 자연수의 합으로 나타낼 수 있다. 당신은 어떤 자연수 N(1 ≤ N ≤ 10,000,000)에 대해서, 이 N을 몇 개의 연속된 자연수의 합으로 나타내는 가지수를 알고 싶어한다. 이때, 사용하는 자연수는 N이하여야 한다.

예를 들어, 15를 나타내는 방법은 15, 7+8, 4+5+6, 1+2+3+4+5의 4가지가 있다. 반면에 10을 나타내는 방법은 10, 1+2+3+4의 2가지가 있다.

N을 입력받아 가지수를 출력하는 프로그램을 작성하시오.

입력
첫 줄에 정수 N이 주어진다.

출력
입력된 자연수 N을 몇 개의 연속된 자연수의 합으로 나타내는 가지수를 출력하시오

예제 입력 1 
15
예제 출력 1 
4
"""

# Answer
import sys
input = sys.stdin.readline

n = int(input())
count = 0

for i in range(1, n+1):
    sum = 0
    for j in range(i, n+1):
        sum += j
        if sum == n:
            count += 1
            break
        elif sum > n:
            break
        
print(count)