/*
골뱅이 찍기 - ㅂ
 
시간 제한	메모리 제한	
1 초	512 MB

문제
서준이는 아빠로부터 골뱅이가 들어 있는 상자를 생일 선물로 받았다. 
상자 안에는 ㅂ자 모양의 골뱅이가 들어있다. ㅂ자 모양은 가로 및 세로로 각각 5개의 셀로 구성되어 있다. 
상자에는 정사각형 모양의 셀의 크기를 나타내는 숫자 하나가 적혀있다. 
셀의 크기 N이 주어지면 예제 출력과 같은 방식으로 골뱅이 모양을 출력하시오.

입력
첫째 줄에 정수 N(1 ≤ N ≤ 100)이 주어진다.

출력
셀의 크기가 N인 골뱅이를 출력한다.

예제 입력 1 
1
예제 출력 1 
@   @
@   @
@@@@@
@   @
@@@@@
예제 입력 2 
3
예제 출력 2 
@@@         @@@
@@@         @@@
@@@         @@@
@@@         @@@
@@@         @@@
@@@         @@@
@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@
@@@         @@@
@@@         @@@
@@@         @@@
@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@
*/

#include <bits/stdc++.h>
using namespace std;

void print(int n) {
    string at = string(n, '@');
    string space = string(n * 3, ' '); 

    for (int i = 0; i < 2 * n; i++) {
        cout << at << space << at << '\n';
    }

    for (int i = 0; i < n; i++) {
        cout << string(n * 5, '@') << '\n';
    }

    for (int i = 0; i < n; i++) {
        cout << at << space << at << '\n';
    }

    for (int i = 0; i < n; i++) {
        cout << string(n * 5, '@') << '\n';
    }
}

int main() {
    ios::sync_with_stdio(0);
    cin.tie(0);

    int n;
    cin >> n;

    print(n);

    return 0;
}
