/*
장기
 
시간 제한	메모리 제한	제출	정답	맞힌 사람	정답 비율
0.3 초 (추가 시간 없음)	1024 MB	639	440	414	68.885%
문제
DGIST는 대구 시내와 거리가 멀어 놀거리가 많지 않다. 지루함에 지친 척이와 은규는 동양의 오래된 보드게임인 장기를 두기로 했다.

장기는 초나라와 한나라 두 편으로 나뉘어 각 
$16$개의 기물을 가지고 번갈아 진행하여 상대의 궁을 잡는 전략 게임이다. 장기의 기물에는 궁, 차, 포, 마, 상, 사, 졸(병)이 있다. 척이와 은규는 각 기물에 점수를 정하여 경기 중간에 자신의 상황을 정량적으로 확인하고자 한다. 초기의 기물 개수와 각 기물에 대한 점수 계산 방식은 다음과 같다.

궁(총 
$1$개): 점수 없음
차(총 
$2$개): 각 
$13$점
포(총 
$2$개): 각 
$7$점
마(총 
$2$개): 각 
$5$점
상(총 
$2$개): 각 
$3$점
사(총 
$2$개): 각 
$3$점
졸(병)(총 
$5$개): 각 
$2$점
처음에 척이와 은규는 각자 총 
$1\times 0 + 2\times 13 + 2\times 7 + 2\times 5 + 2\times 3 + 2\times 3 + 5\times 2 = 72$점에서 시작한다. 단, 무승부를 방지하기 위해 후수인 한나라는 
$1.5$점을 추가하여 
$73.5$점으로 계산한다.

척이는 선수인 초나라로, 은규는 후수인 한나라로 경기를 진행한다. 경기 도중 남아있는 기물들의 수에 대한 정보가 주어질 때, 현재 점수가 더 높은 사람의 이름을 출력하라.

입력
첫째 줄에 현재 남아있는 척이의 차, 포, 마, 상, 사, 졸의 기물 수가 공백으로 구분되어 주어진다.

둘째 줄에 현재 남아있는 은규의 차, 포, 마, 상, 사, 병의 기물 수가 공백으로 구분되어 주어진다.

입력에서 주어지는 값은 모두 
$0$ 이상의 정수이며, 각 기물의 개수는 초기 기물 개수보다 같거나 적음이 보장된다.

출력
초나라의 기물 점수가 더 높다면 cocjr0208, 한나라의 기물 점수가 더 높다면 ekwoo를 출력하라.

예제 입력 1 
1 1 1 1 1 1
1 1 1 1 1 1
예제 출력 1 
ekwoo
예제 입력 2 
2 1 0 2 1 5
1 2 2 1 1 2
예제 출력 2 
cocjr0208
*/

#include <bits/stdc++.h>

using namespace std;

int main() {
    ios::sync_with_stdio(0);
    cin.tie(0);
    cout.tie(0);

    int a[6], b[6];
    for (int i = 0; i < 6; i++) {
        cin >> a[i];
    }

    for (int i = 0; i < 6; i++) {
        cin >> b[i];
    }

    int score_a = 0, score_b = 0;

    score_a += 13 * a[0] + 7 * a[1] + 5 * a[2] + 3 * a[3] + 3 * a[4] + 2 * a[5];
    score_b += 13 * b[0] + 7 * b[1] + 5 * b[2] + 3 * b[3] + 3 * b[4] + 2 * b[5] + 1.5;
    
    cout << (score_a > score_b ? "cocjr0208" : "ekwoo");

	return 0;
}
